BAndysc/STM32_Mario/src/includes/inc/interrupt_vector_stm32.c
/* This file is generated automatically. */

#if defined STM32F030x6
  #include <interrupt_vector_stm32f030x6.c>
#elif defined STM32F030x8
  #include <interrupt_vector_stm32f030x8.c>
#elif defined STM32F031x6
  #include <interrupt_vector_stm32f031x6.c>
#elif defined STM32F038xx
  #include <interrupt_vector_stm32f038xx.c>
#elif defined STM32F042x6
  #include <interrupt_vector_stm32f042x6.c>
#elif defined STM32F048xx
  #include <interrupt_vector_stm32f048xx.c>
#elif defined STM32F051x8
  #include <interrupt_vector_stm32f051x8.c>
#elif defined STM32F058xx
  #include <interrupt_vector_stm32f058xx.c>
#elif defined STM32F071xB
  #include <interrupt_vector_stm32f071xb.c>
#elif defined STM32F072xB
  #include <interrupt_vector_stm32f072xb.c>
#elif defined STM32F078xx
  #include <interrupt_vector_stm32f078xx.c>
#elif defined STM32F091xC
  #include <interrupt_vector_stm32f091xc.c>
#elif defined STM32F098xx
  #include <interrupt_vector_stm32f098xx.c>
#elif defined STM32F0XX
  #include <interrupt_vector_stm32f0xx.c>
#elif defined STM32F10X_CL
  #include <interrupt_vector_stm32f10x_cl.c>
#elif defined STM32F10X_HD
  #include <interrupt_vector_stm32f10x_hd.c>
#elif defined STM32F10X_HD_VL
  #include <interrupt_vector_stm32f10x_hd_vl.c>
#elif defined STM32F10X_LD
  #include <interrupt_vector_stm32f10x_ld.c>
#elif defined STM32F10X_LD_VL
  #include <interrupt_vector_stm32f10x_ld_vl.c>
#elif defined STM32F10X_MD
  #include <interrupt_vector_stm32f10x_md.c>
#elif defined STM32F10X_MD_VL
  #include <interrupt_vector_stm32f10x_md_vl.c>
#elif defined STM32F10X_XL
  #include <interrupt_vector_stm32f10x_xl.c>
#elif defined STM32F205xx
  #include <interrupt_vector_stm32f205xx.c>
#elif defined STM32F207xx
  #include <interrupt_vector_stm32f207xx.c>
#elif defined STM32F215xx
  #include <interrupt_vector_stm32f215xx.c>
#elif defined STM32F217xx
  #include <interrupt_vector_stm32f217xx.c>
#elif defined STM32F2XX
  #include <interrupt_vector_stm32f2xx.c>
#elif defined STM32F301x8
  #include <interrupt_vector_stm32f301x8.c>
#elif defined STM32F302x8
  #include <interrupt_vector_stm32f302x8.c>
#elif defined STM32F302xC
  #include <interrupt_vector_stm32f302xc.c>
#elif defined STM32F302xE
  #include <interrupt_vector_stm32f302xe.c>
#elif defined STM32F303x8
  #include <interrupt_vector_stm32f303x8.c>
#elif defined STM32F303xC
  #include <interrupt_vector_stm32f303xc.c>
#elif defined STM32F303xE
  #include <interrupt_vector_stm32f303xe.c>
#elif defined STM32F318xx
  #include <interrupt_vector_stm32f318xx.c>
#elif defined STM32F328xx
  #include <interrupt_vector_stm32f328xx.c>
#elif defined STM32F334x8
  #include <interrupt_vector_stm32f334x8.c>
#elif defined STM32F358xx
  #include <interrupt_vector_stm32f358xx.c>
#elif defined STM32F373xC
  #include <interrupt_vector_stm32f373xc.c>
#elif defined STM32F378xx
  #include <interrupt_vector_stm32f378xx.c>
#elif defined STM32F398xx
  #include <interrupt_vector_stm32f398xx.c>
#elif defined STM32F401xC
  #include <interrupt_vector_stm32f401xc.c>
#elif defined STM32F401xE
  #include <interrupt_vector_stm32f401xe.c>
#elif defined STM32F405xx
  #include <interrupt_vector_stm32f405xx.c>
#elif defined STM32F407xx
  #include <interrupt_vector_stm32f407xx.c>
#elif defined STM32F411xE
  #include <interrupt_vector_stm32f411xe.c>
#elif defined STM32F415xx
  #include <interrupt_vector_stm32f415xx.c>
#elif defined STM32F417xx
  #include <interrupt_vector_stm32f417xx.c>
#elif defined STM32F427xx
  #include <interrupt_vector_stm32f427xx.c>
#elif defined STM32F429xx
  #include <interrupt_vector_stm32f429xx.c>
#elif defined STM32F437xx
  #include <interrupt_vector_stm32f437xx.c>
#elif defined STM32F439xx
  #include <interrupt_vector_stm32f439xx.c>
#elif defined STM32L051xx
  #include <interrupt_vector_stm32l051xx.c>
#elif defined STM32L052xx
  #include <interrupt_vector_stm32l052xx.c>
#elif defined STM32L053xx
  #include <interrupt_vector_stm32l053xx.c>
#elif defined STM32L061xx
  #include <interrupt_vector_stm32l061xx.c>
#elif defined STM32L062xx
  #include <interrupt_vector_stm32l062xx.c>
#elif defined STM32L063xx
  #include <interrupt_vector_stm32l063xx.c>
#elif defined STM32L100xBA
  #include <interrupt_vector_stm32l100xba.c>
#elif defined STM32L100xB
  #include <interrupt_vector_stm32l100xb.c>
#elif defined STM32L100xC
  #include <interrupt_vector_stm32l100xc.c>
#elif defined STM32L151xBA
  #include <interrupt_vector_stm32l151xba.c>
#elif defined STM32L151xB
  #include <interrupt_vector_stm32l151xb.c>
#elif defined STM32L151xCA
  #include <interrupt_vector_stm32l151xca.c>
#elif defined STM32L151xC
  #include <interrupt_vector_stm32l151xc.c>
#elif defined STM32L151xD
  #include <interrupt_vector_stm32l151xd.c>
#elif defined STM32L151xE
  #include <interrupt_vector_stm32l151xe.c>
#elif defined STM32L152xBA
  #include <interrupt_vector_stm32l152xba.c>
#elif defined STM32L152xB
  #include <interrupt_vector_stm32l152xb.c>
#elif defined STM32L152xCA
  #include <interrupt_vector_stm32l152xca.c>
#elif defined STM32L152xC
  #include <interrupt_vector_stm32l152xc.c>
#elif defined STM32L152xD
  #include <interrupt_vector_stm32l152xd.c>
#elif defined STM32L152xE
  #include <interrupt_vector_stm32l152xe.c>
#elif defined STM32L162xCA
  #include <interrupt_vector_stm32l162xca.c>
#elif defined STM32L162xC
  #include <interrupt_vector_stm32l162xc.c>
#elif defined STM32L162xD
  #include <interrupt_vector_stm32l162xd.c>
#elif defined STM32L162xE
  #include <interrupt_vector_stm32l162xe.c>
#elif defined STM32L1XX_HD
  #include <interrupt_vector_stm32l1xx_hd.c>
#elif defined STM32L1XX_MDP
  #include <interrupt_vector_stm32l1xx_mdp.c>
#elif defined STM32L1XX_MD
  #include <interrupt_vector_stm32l1xx_md.c>
#else
  #error STM32 device type or subfamily is unknown or undefined.
#endif
